id: 36bcc5f7-11f0-4498-a724-bd5bb747bbbd
status: experimental
title: Low Disk Space
description: Detects low disk space warnings from system logs.
references:
  - https://documentation.wazuh.com/current/user-manual/capabilities/command-monitoring/use-cases/disk-space-utilization.html
author: Miguel Itzep
date: 2024/07/18
logsource:
  product: linux
  category: df
detection:
  selection:
    Filesystem: "/dev/*"
    Capacity: "> 90%"
  condition: selection
fields:
  - ComputerName
falsepositives:
  - Unknown
level: high
