id: f7f54497-47ac-4731-b17f-b55359b69408
status: experimental
title: Event Lack
description: Detects the absence of specific event types over a given period.
references:
  - https://gallery.logrhythm.com/use-cases/alerting-on-the-absence-of-an-event-use-case.pdf
author: Miguel Itzep
date: 2024/07/19
logsource:
  product: opensearch
  category: alerting
detection:
  selection:
    EventCategory: "Firewall"
  timeframe: "15m"
  condition: not selection
fields:
  - ComputerName
falsepositives:
  - Network issues
  - System maintenance periods
level: high
